SLS/src/Catalogs/БазыДанных1С/БазыДанных1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БазыДанных1С</name>
  <owners>Catalog.Кластеры1СПредприятия</owners>
  <attributes>
    <name>ИмяВКластере</name>
    <comment>Имя информационной базы как оно задано в кластере 1С:Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляемаяКонфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДаннызSQL</name>
    <type>
      <types>CatalogRef.БазыДанныхSQL</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортПубликации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКПубликацииНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЖурналаИсключений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SLS/src/Catalogs/БазыДанных1С/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторЖурналаИсключений = "";
	
	Если ЗначениеЗаполнено(ИмяВКластере) Тогда
		ИмяВКластере = ИмяВКластере + "1";
	КонецЕсли;
	
	БазаДаннызSQL = Неопределено;
	
	ИмяСервераПубликации = "";
	ПортПубликации = 0;
	ПутьКПубликацииНаСервере = "";
	
КонецПроцедуры
